<?php
$images = [
    get_stylesheet_directory_uri() . '/images/section-1-image-1.webp',
    get_stylesheet_directory_uri() . '/images/section-1-image-2.webp',
    get_stylesheet_directory_uri() . '/images/section-1-image-3.webp',
    get_stylesheet_directory_uri() . '/images/section-1-image-4.webp',
];

?>

<!DOCTYPE html>
<html <?php language_attributes(); ?>>

<head>
    <meta charset="<?php bloginfo('charset'); ?>">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>A Király Halott | Hivatalos weboldal</title>
    <link rel='stylesheet' href='<?php echo get_stylesheet_directory_uri() . '/build/main.css' ?>' />
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Quando&display=swap" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Caveat&display=swap" rel="stylesheet">
</head>

<body class="mx-auto bg-[var(--smoke-white)]">
    <?php get_template_part('template-parts/navbar'); ?>
    <?php get_template_part('template-parts/hero'); ?>
    <section>
        <div class="text-center relative">
            <div class="ml-[-7rem]">
                <h1 class="text-[4.1875rem]">Lorem<br>ipsum dolor<br>sit amet</h1>
                <h2 class="text-[1.25rem] uppercase">Lorem ipsum dolor sit amet</h2>
            </div>
            <!-- Mouse -->

            <div class="w-max mr-auto ml-[calc(50%-4rem)] mt-[1.3125rem]">
                <svg width="18" height="156" viewBox="0 0 18 156" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_233_2)">
                        <path d="M8.23922 141.92H9.79922C13.1192 141.92 15.7992 139.2 15.7992 135.88V125.72C15.7992 122.4 13.0792 119.68 9.75922 119.68H8.19922C4.87922 119.68 2.19922 122.4 2.19922 125.72V135.88C2.19922 139.2 4.87922 141.92 8.23922 141.92ZM3.39922 125.72C3.39922 123.04 5.55922 120.88 8.23922 120.88H9.79922C12.4792 120.88 14.6392 123.04 14.6392 125.72V135.88C14.6392 138.56 12.4792 140.72 9.79922 140.72H8.23922C5.55922 140.72 3.39922 138.56 3.39922 135.88V125.72Z" fill="black" />
                        <path d="M9.00039 138.36C9.32039 138.36 9.60039 138.08 9.60039 137.76V135.48C9.60039 135.16 9.32039 134.88 9.00039 134.88C8.68039 134.88 8.40039 135.16 8.40039 135.48V137.76C8.40039 138.12 8.68039 138.36 9.00039 138.36Z" fill="black" />
                        <path d="M11.1156 151.605L9.52018 153.215V148.525C9.52018 148.245 9.27748 148 8.99998 148C8.72248 148 8.47977 148.245 8.47977 148.525V153.25L6.88438 151.605C6.67628 151.395 6.36418 151.395 6.15608 151.605C5.94797 151.815 5.94797 152.13 6.15608 152.34L8.65318 154.86C8.68788 154.895 8.75717 154.965 8.82657 154.965C8.89597 155 8.96528 155 8.99998 155C9.03468 155 9.13868 155 9.17338 154.965C9.24278 154.93 9.31208 154.895 9.34678 154.86L11.8439 152.34C12.052 152.13 12.052 151.815 11.8439 151.605C11.6358 151.395 11.3237 151.43 11.1156 151.605Z" fill="black" />
                        <path d="M3 132.5H15" stroke="black" />
                        <g clip-path="url(#clip1_233_2)">
                            <path d="M9 2V112" stroke="black" stroke-linecap="round" />
                        </g>
                    </g>
                    <defs>
                        <clipPath id="clip0_233_2">
                            <rect width="18" height="156" fill="white" />
                        </clipPath>
                        <clipPath id="clip1_233_2">
                            <rect width="2" height="112" fill="white" transform="translate(8 1)" />
                        </clipPath>
                    </defs>
                </svg>

            </div>
            <!-- Relative images -->

            <!-- Tupi -->
            <img class="absolute z-20 left-[11.04%] top-[16.45vw] w-[16.84%]"" src=" <?php echo  $images[0] ?>" alt="">
            <!-- Bence -->
            <img class="absolute z-10 left-[16.14%] top-0 w-[16.14%]" src="<?php echo  $images[1] ?>" alt="">
            <!-- Tupi 2 -->
            <img class="absolute z-10 w-[21.87%] left-[61.97%] top-0" src="<?php echo  $images[2] ?>" alt="">
            <!-- Audience with mobile -->
            <img class="absolute z-20 w-[19.11%] left-[67.76%] top-[25.31vw]" src="<?php echo  $images[3] ?>" alt="">

            <!-- Relative texts -->
            <span class="absolute font-handwritten text-[1.5rem] left-[29.63%] top-[22.91vw] text-left">Épp, hogy megjöttél,<br>szárnyat bontott a tél...</span>
            <div class="absolute w-max left-[54.27%] top-[32.23vw]">
                <span class="font-handwritten text-[1.5rem] text-left">Bárcsak itt lennél,<br>örökkön örökké...</span>
                <svg class="inline" width="16" height="12" viewBox="0 0 16 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0.72474 0.932387C0.285884 1.50796 0.105651 2.4205 0.184047 3.66999C0.270054 5.04078 0.567164 6.18521 1.07538 7.10326C1.58359 8.02132 2.22291 8.69975 2.99335 9.13856C3.76454 9.5895 4.57472 9.78833 5.42389 9.73505C6.34584 9.6772 7.08728 9.36275 7.64821 8.7917C8.2099 8.23277 8.64264 7.46272 8.94644 6.48154C9.06323 6.596 9.1804 6.71652 9.29795 6.84311C9.42764 6.96894 9.55087 7.08909 9.66766 7.20355C10.2903 7.80995 10.8867 8.38755 11.457 8.93635C12.0281 9.49728 12.5404 9.99491 12.9939 10.4292C13.4595 10.8628 13.8402 11.2043 14.136 11.4537C14.4439 11.7023 14.6403 11.8239 14.7252 11.8186C14.895 11.8079 15.008 11.7643 15.0641 11.6877C15.1323 11.6104 15.1637 11.5292 15.1584 11.4443C15.1516 11.3352 14.9441 11.0376 14.5361 10.5517C14.4123 10.4076 14.2764 10.252 14.1286 10.0846C14.2811 10.0325 14.4198 9.9586 14.5456 9.87359C15.4453 9.26546 15.5164 8.22211 15.4745 7.55501C15.468 7.4508 15.442 7.35242 15.4004 7.26319C15.3472 6.88396 15.2013 6.46105 14.9626 5.99446C14.685 5.45166 14.3338 4.9013 13.9091 4.34336C13.4851 3.79757 13.0335 3.29613 12.5542 2.83905C12.0749 2.38197 11.6135 2.01512 11.1698 1.73848C10.7262 1.46185 10.3528 1.33305 10.0495 1.35207C9.60067 1.38024 9.22238 1.56229 8.91463 1.89825C8.60688 2.2342 8.33103 2.78738 8.08708 3.55776C7.44852 2.89146 6.81338 2.27975 6.18167 1.72263C5.56285 1.17688 4.95126 0.746367 4.3469 0.431104C3.75467 0.115079 3.18561 -0.0258086 2.63972 0.00844189C1.81482 0.0601982 1.17649 0.36818 0.72474 0.932387ZM13.8616 7.92259C13.8143 7.77248 13.783 7.57493 13.7676 7.32993L13.7505 7.05699C13.7573 6.97131 13.7634 6.8735 13.7686 6.76356C13.3765 6.14269 12.9628 5.56581 12.5274 5.0329C12.0921 4.49999 11.65 4.05276 11.201 3.69121C10.7528 3.34179 10.3244 3.11292 9.91572 3.0046C9.82328 3.27833 9.72592 3.57063 9.62364 3.88152C9.53425 4.20378 9.43994 4.54461 9.3407 4.90402C9.57581 5.1572 9.80484 5.41076 10.0278 5.6647C10.2629 5.91788 10.4976 6.165 10.732 6.40605C11.3177 7.03218 11.8681 7.621 12.3833 8.1725C12.3957 8.16674 12.4083 8.16125 12.4212 8.15606C12.7759 8.01255 13.1727 8.13819 13.3852 8.43701C13.3986 8.44236 13.4146 8.44855 13.4339 8.45583L13.5185 8.48742C13.5493 8.49903 13.5871 8.5136 13.6263 8.53022L13.6342 8.53349L13.638 8.5309C13.7123 8.48073 13.7698 8.40738 13.811 8.27022C13.8395 8.17545 13.8567 8.05936 13.8616 7.92259ZM5.88867 3.45821C6.4582 3.99488 7.05504 4.57854 7.67919 5.20921C7.48985 6.0736 7.211 6.7731 6.84265 7.30772C6.48642 7.84158 6.02323 8.12639 5.45308 8.16216C5.00423 8.19033 4.55953 8.09035 4.11896 7.86224C3.69128 7.6455 3.29429 7.33549 2.92799 6.93222C2.57381 6.52819 2.28293 6.06538 2.05535 5.54379C1.84066 5.03358 1.7158 4.49946 1.68079 3.94144C1.63132 3.15293 1.73051 2.59866 1.97836 2.27864C2.23911 1.96999 2.59997 1.80121 3.06095 1.77228C3.42487 1.74945 3.84798 1.89341 4.33027 2.20415C4.81256 2.51489 5.33202 2.93291 5.88867 3.45821Z" fill="#2B2C2D" />
                </svg>
            </div>

        </div>
    </section>
</body>

</html>